//DESCRIPTION
//n의 제곱근이란, 제곱했을 때 n이 되는 수다.
//
//이진탐색은 범위를 n, n/2, n/4, ... 로 좁혀나가는 방식이다.
//
//자연수 n의 제곱근을 이진탐색으로 소수점 다섯번째 자리까지 구해보자.
//
//이 때, 최댓값을 소수점 다섯번째 자리까지 반올림한 값과 최솟값을 소수점 다섯번째 자리까지 반올림한 값이 같아지면 탐색을 중단한다.
//
//INPUT
//Line 1: 제곱수가 아닌 자연수 n이 입력된다.(1<n<1000000)
//
//OUTPUT
//Line 1~: 0초과 n 미만의 범위를 이진탐색하여 소수점 다섯번째 자리까지 구하는 과정을 출력한다. (Sample Output 참고)
//
//SAMPLE INPUT
//2
//
//SAMPLE OUTPUT
//0.00000 < sqrt(2) < 2.00000
//1.00000 < sqrt(2) < 2.00000
//1.00000 < sqrt(2) < 1.50000
//1.25000 < sqrt(2) < 1.50000
//1.37500 < sqrt(2) < 1.50000
//1.37500 < sqrt(2) < 1.43750
//1.40625 < sqrt(2) < 1.43750
//1.40625 < sqrt(2) < 1.42188
//1.41406 < sqrt(2) < 1.42188
//1.41406 < sqrt(2) < 1.41797
//1.41406 < sqrt(2) < 1.41602
//1.41406 < sqrt(2) < 1.41504
//1.41406 < sqrt(2) < 1.41455
//1.41406 < sqrt(2) < 1.41431
//1.41418 < sqrt(2) < 1.41431
//1.41418 < sqrt(2) < 1.41425
//1.41418 < sqrt(2) < 1.41422
//1.41420 < sqrt(2) < 1.41422
//1.41421 < sqrt(2) < 1.41422
//1.41421 < sqrt(2) < 1.41422
//1.41421 < sqrt(2) < 1.41422

#include <stdio.h>
#include <math.h>
 
int main() {
    int N;
    scanf("%d", &N);
 
    double s = 0.;
    double e = (double)N;
    double mid;
    double ans = sqrt(N);
 
    while((floor(s*100000+0.5)/100000)<(floor(e*100000+0.5)/100000)) {
        printf("%.5lf < sqrt(%d) < %.5lf\n", s, N, e);
 
        mid = (s+e)/2;
        if(mid == ans) break;
        else if(mid > ans) e = mid;
        else s = mid;
    }
}
